package task3_4;

public class Task {
    // Данная задача теоретическая.
//    Ответ: HashSet коллекции понадобится меньше времени на выполнение данного метода при большом наборе данных, потому что в случае с
//     ArrayList и LinkedList, нам придется пройтись полностью по всем элементам этих коллекций,
//     в свою очередь у множества будет константное время на выполнение данной операции, потому что в Листе у нас храняться целые
//     числа и соответсвенно хешкод будет практически идеальным для быстрого выполнения.
//
//
//
//
//
//
//
//
//


}
